tylertms/dspic33e-sim/conformance/dma.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} DmaConformance;

enum {
    DMA_FORCE = 0x8000u,
    DMA_TEST_READ_PAD = 0x0290u,
    DMA_TEST_WRITE_PAD = 0x0298u,
    DMA_TEST_ALT_WRITE_PAD = 0x0904u,
    DMA_TEST_BIDIRECTIONAL_PAD = 0x0608u
};

static const uint16_t readable_pads[] = {
    0x0144u, 0x014cu, 0x0154u, 0x015cu, 0x0226u, 0x0236u, 0x0248u, 0x0256u, 0x0268u,
    0x0290u, 0x02a8u, 0x02b6u, 0x02c8u, 0x0300u, 0x0340u, 0x0440u, 0x0540u, 0x0608u};

static const uint16_t writable_pads[] = {0x0224u, 0x0234u, 0x0248u, 0x0254u, 0x0268u,
                                         0x0298u, 0x02a8u, 0x02b4u, 0x02c8u, 0x0442u,
                                         0x0542u, 0x0608u, 0x0904u, 0x0906u, 0x090eu,
                                         0x0910u, 0x0918u, 0x091au, 0x0922u, 0x0924u};

static const uint8_t dma_irqs[DSPIC33_DMA_COUNT] = {
    4u, 14u, 24u, 36u, 46u, 61u, 68u, 69u, 118u, 119u, 120u, 121u, 130u, 131u, 132u};

static void expect(DmaConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[dma-failed] %s\n", name);
    }
}

static uint16_t channel_base(uint8_t channel) {
    return (uint16_t)(0x0b00u + channel * 0x10u);
}

static uint16_t stored_word(const Dspic33* cpu, uint16_t address) {
    return (uint16_t)(cpu->data[address] | ((uint16_t)cpu->data[address + 1u] << 8u));
}

static void store_peripheral_word(Dspic33* cpu, uint16_t value) {
    cpu->data[DMA_TEST_READ_PAD] = (uint8_t)value;
    cpu->data[DMA_TEST_READ_PAD + 1u] = (uint8_t)(value >> 8u);
}

static bool interrupt_flag(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = dma_irqs[channel];
    return (dspic33_read_word(cpu, (uint16_t)(0x0800u + (irq / 16u) * 2u)) &
            (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = dma_irqs[channel];
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    uint16_t mask = (uint16_t)(1u << (irq % 16u));
    dspic33_write_word(cpu, address,
                       (uint16_t)(dspic33_read_word(cpu, address) & ~mask));
}

static void configure_channel(Dspic33* cpu, uint8_t channel, uint16_t control,
                              uint8_t request, uint32_t start_a, uint32_t start_b,
                              uint16_t pad, uint16_t count) {
    uint16_t base = channel_base(channel);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), request);
    dspic33_write_word(cpu, (uint16_t)(base + 4u), (uint16_t)start_a);
    dspic33_write_word(cpu, (uint16_t)(base + 6u), (uint16_t)(start_a >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 8u), (uint16_t)start_b);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0au), (uint16_t)(start_b >> 16u));
    dspic33_write_word(cpu, (uint16_t)(base + 0x0cu), pad);
    dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), count);
    dspic33_write_word(cpu, base, (uint16_t)(control | 0x8000u));
}

static bool request(Dspic33* cpu, uint8_t source, uint16_t indirect) {
    return dspic33_dma_request(cpu, source, indirect, 0u) &&
           dspic33_device_advance(cpu, 1u);
}

static bool pad_in_set(uint16_t pad, const uint16_t* pads, size_t count) {
    size_t index;
    for (index = 0u; index < count; index++) {
        if (pad == pads[index]) {
            return true;
        }
    }
    return false;
}

static void pad_membership_cases(DmaConformance* state) {
    static const uint16_t firmware_read_pads[] = {0x0236u, 0x0248u, 0x0256u, 0x0300u,
                                                  0x0608u};
    static const uint16_t firmware_write_pads[] = {0x0234u, 0x0248u, 0x0254u, 0x0608u};
    uint32_t address;
    uint32_t readable = 0u;
    uint32_t writable = 0u;
    uint32_t either = 0u;
    bool exact = true;
    size_t index;
    for (address = 0u; address <= UINT16_MAX; address++) {
        bool expected_read =
            pad_in_set((uint16_t)address, readable_pads,
                       sizeof(readable_pads) / sizeof(readable_pads[0]));
        bool expected_write =
            pad_in_set((uint16_t)address, writable_pads,
                       sizeof(writable_pads) / sizeof(writable_pads[0]));
        bool actual_read = dspic33_device_dma_pad_valid((uint16_t)address, false);
        bool actual_write = dspic33_device_dma_pad_valid((uint16_t)address, true);
        exact = exact && actual_read == expected_read && actual_write == expected_write;
        readable += actual_read;
        writable += actual_write;
        either += actual_read || actual_write;
    }
    expect(state, exact && readable == 18u && writable == 20u && either == 33u,
           "DMA PAD direction allowlists are exhaustive");
    exact = true;
    for (index = 0u; index < sizeof(firmware_read_pads) / sizeof(firmware_read_pads[0]);
         index++) {
        exact = exact && dspic33_device_dma_pad_valid(firmware_read_pads[index], false);
    }
    for (index = 0u;
         index < sizeof(firmware_write_pads) / sizeof(firmware_write_pads[0]);
         index++) {
        exact = exact && dspic33_device_dma_pad_valid(firmware_write_pads[index], true);
    }
    expect(state, exact, "firmware DMA PAD routes remain supported");
}

static void register_cases(DmaConformance* state, Dspic33* cpu) {
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_DMA_COUNT; channel++) {
        uint16_t base = channel_base(channel);
        expect(state, dspic33_read_word(cpu, base) == 0u, "DMAxCON reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0u,
               "DMAxREQ reset");
        dspic33_write_word(cpu, base, 0x7fffu);
        expect(state, dspic33_read_word(cpu, base) == 0x7833u, "DMAxCON mask");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x7fffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x00ffu,
               "DMAxREQ mask");
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0xffffu);
        dspic33_write_word(cpu, (uint16_t)(base + 0x0au), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0x00ffu,
               "DMAxSTAH mask");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0au)) == 0x00ffu,
               "DMAxSTBH mask");
        dspic33_write_word(cpu, (uint16_t)(base + 0x0eu), 0xffffu);
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 0x0eu)) == 0x3fffu,
               "DMAxCNT mask");
    }
    dspic33_write_word(cpu, 0x0bf0u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf2u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf4u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf6u, 0xffffu);
    dspic33_write_word(cpu, 0x0bf8u, 0xffffu);
    dspic33_write_word(cpu, 0x0bfau, 0xffffu);
    expect(state, dspic33_read_word(cpu, 0x0bf0u) == 0u, "DMAPWC read only");
    expect(state, dspic33_read_word(cpu, 0x0bf2u) == 0u, "DMARQC read only");
    expect(state, dspic33_read_word(cpu, 0x0bf4u) == 0u, "DMAPPS read only");
    expect(state, dspic33_read_word(cpu, 0x0bf6u) == 0x000fu,
           "DMALCA reset and read only");
    expect(state, dspic33_read_word(cpu, 0x0bf8u) == 0u, "DSADRL read only");
    expect(state, dspic33_read_word(cpu, 0x0bfau) == 0u, "DSADRH read only");
    expect(state,
           dspic33_schedule(cpu, DSPIC33_EVENT_DMA, DSPIC33_DMA_COUNT * 2u, 0u, 0u) &&
               dspic33_device_advance(cpu, 0u) && cpu->io.dma_active == 0u,
           "invalid DMA event source ignored");
}

static void direction_and_width_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x5aa5u);
    configure_channel(cpu, 0u, 0x2001u, 0x44u, 0x2000u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x44u, 0u), "word RAM request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x5aa5u,
           "word RAM to peripheral");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "word one-shot disables");
    expect(state, interrupt_flag(cpu, 0u), "word full interrupt");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0xa55au);
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0x7e00u);
    configure_channel(cpu, 0u, 0x6001u, 0x45u, 0x2000u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x45u, 0u), "byte RAM request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x7e5au,
           "byte RAM to peripheral");

    dspic33_reset(cpu, 0u);
    store_peripheral_word(cpu, 0x369cu);
    configure_channel(cpu, 0u, 0x0001u, 0x46u, 0x2000u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, request(cpu, 0x46u, 0u), "word peripheral request");
    expect(state, dspic33_read_word(cpu, 0x2000u) == 0x369cu, "word peripheral to RAM");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0xcc00u);
    store_peripheral_word(cpu, 0x12abu);
    configure_channel(cpu, 0u, 0x4001u, 0x47u, 0x2000u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, request(cpu, 0x47u, 0u), "byte peripheral request");
    expect(state, dspic33_read_word(cpu, 0x2000u) == 0xccabu, "byte peripheral to RAM");
}

