tylertms/dspic33e-sim/conformance/dma.c
static void invalid_write_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x5aa5u);
    configure_channel(cpu, 0u, 0x2001u, 0x48u, 0x2000u, 0u, 0x0e32u, 0u);
    expect(state, request(cpu, 0x48u, 0u), "invalid word PAD request");
    expect(state,
           dspic33_read_word(cpu, 0x0e34u) == 0u && interrupt_flag(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "invalid word PAD invokes no handler and completes");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x00a5u);
    configure_channel(cpu, 0u, 0x6001u, 0x49u, 0x2000u, 0u, 0x0e32u, 0u);
    expect(state, request(cpu, 0x49u, 0u), "invalid low-byte PAD request");
    expect(state, dspic33_read_word(cpu, 0x0e34u) == 0u,
           "invalid low-byte PAD invokes no handler");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x003cu);
    configure_channel(cpu, 0u, 0x6001u, 0x4au, 0x2000u, 0u, 0x0e33u, 0u);
    expect(state, request(cpu, 0x4au, 0u), "invalid high-byte PAD request");
    expect(state, dspic33_read_word(cpu, 0x0e34u) == 0u,
           "invalid high-byte PAD invokes no handler");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2000u, 0x5aa5u);
    configure_channel(cpu, 0u, 0x2001u, 0x4bu, 0x2000u, 0u, 0x0e32u, 0u);
    expect(state, dspic33_dma_request(cpu, 0x4bu, 0u, 1u),
           "queue invalid PAD with concurrent CPU write");
    dspic33_write_word(cpu, 0x0e32u, 0x7777u);
    expect(state,
           dspic33_device_advance(cpu, 1u) &&
               dspic33_read_word(cpu, 0x0e34u) == 0x7777u &&
               dspic33_read_word(cpu, 0x0bf0u) == 0u && cpu->trap_count == 0u,
           "invalid write PAD cannot raise a peripheral collision");
}

static void addressing_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0000u, 0x50u, 0x2200u, 0u, DMA_TEST_READ_PAD, 2u);
    store_peripheral_word(cpu, 0x1111u);
    expect(state, request(cpu, 0x50u, 0u), "post-increment first request");
    expect(state, dspic33_read_word(cpu, 0x0b04u) == 0x2200u,
           "post-increment preserves start register");
    store_peripheral_word(cpu, 0x2222u);
    expect(state, request(cpu, 0x50u, 0u), "post-increment second request");
    expect(state, dspic33_read_word(cpu, 0x0b04u) == 0x2200u,
           "post-increment keeps start register stable");
    store_peripheral_word(cpu, 0x3333u);
    expect(state, request(cpu, 0x50u, 0u), "post-increment third request");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x1111u &&
               dspic33_read_word(cpu, 0x2202u) == 0x2222u &&
               dspic33_read_word(cpu, 0x2204u) == 0x3333u,
           "post-increment addresses");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0000u, 0x53u, 0x2200u, 0u, DMA_TEST_READ_PAD, 3u);
    store_peripheral_word(cpu, 0x7777u);
    expect(state, request(cpu, 0x53u, 0u) && request(cpu, 0x53u, 0u),
           "post-increment before mode switch");
    dspic33_write_word(cpu, 0x0b00u, 0x8010u);
    store_peripheral_word(cpu, 0x8888u);
    expect(state, request(cpu, 0x53u, 0u) && request(cpu, 0x53u, 0u),
           "fixed requests after mode switch");
    expect(state,
           dspic33_read_word(cpu, 0x2204u) == 0x8888u &&
               dspic33_read_word(cpu, 0x2206u) == 0u,
           "fixed mode retains current internal pointer");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0010u, 0x51u, 0x2200u, 0u, DMA_TEST_READ_PAD, 2u);
    store_peripheral_word(cpu, 0x4444u);
    expect(state, request(cpu, 0x51u, 0u), "fixed first request");
    store_peripheral_word(cpu, 0x5555u);
    expect(state, request(cpu, 0x51u, 0u), "fixed second request");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x5555u &&
               dspic33_read_word(cpu, 0x2202u) == 0u,
           "fixed address");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0021u, 0x52u, 0x2400u, 0u, DMA_TEST_READ_PAD, 0u);
    store_peripheral_word(cpu, 0x6a6au);
    expect(state, request(cpu, 0x52u, 0x0034u), "peripheral indirect request");
    expect(state, dspic33_read_word(cpu, 0x2434u) == 0x6a6au,
           "peripheral indirect address");
    expect(state, dspic33_read_word(cpu, 0x0b04u) == 0x2434u,
           "peripheral indirect reports latest address");
}

static void operating_mode_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2500u, 0x1001u);
    dspic33_write_word(cpu, 0x2502u, 0x1002u);
    configure_channel(cpu, 0u, 0x2000u, 0x60u, 0x2500u, 0u, DMA_TEST_WRITE_PAD, 1u);
    expect(state, request(cpu, 0x60u, 0u) && request(cpu, 0x60u, 0u),
           "continuous first block");
    expect(state, interrupt_flag(cpu, 0u), "continuous block interrupt");
    clear_interrupt(cpu, 0u);
    expect(state, request(cpu, 0x60u, 0u), "continuous restarts address");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x1001u,
           "continuous primary restart");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u,
           "continuous remains enabled");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2500u, 0xa001u);
    dspic33_write_word(cpu, 0x2520u, 0xb001u);
    configure_channel(cpu, 0u, 0x2002u, 0x61u, 0x2500u, 0x2520u, DMA_TEST_WRITE_PAD,
                      0u);
    expect(state, request(cpu, 0x61u, 0u), "continuous ping first");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xa001u &&
               (dspic33_read_word(cpu, 0x0bf4u) & 1u) == 0u,
           "continuous ping primary");
    expect(state, request(cpu, 0x61u, 0u), "continuous pong request");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xb001u &&
               (dspic33_read_word(cpu, 0x0bf4u) & 1u) != 0u,
           "continuous pong secondary");
    expect(state, request(cpu, 0x61u, 0u), "continuous ping restart");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xa001u &&
               (dspic33_read_word(cpu, 0x0bf4u) & 1u) == 0u,
           "continuous ping cycles");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2500u, 0xc001u);
    dspic33_write_word(cpu, 0x2520u, 0xd001u);
    configure_channel(cpu, 0u, 0x2003u, 0x62u, 0x2500u, 0x2520u, DMA_TEST_WRITE_PAD,
                      0u);
    expect(state, request(cpu, 0x62u, 0u), "one-shot ping request");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u,
           "one-shot ping remains for secondary");
    expect(state, request(cpu, 0x62u, 0u), "one-shot pong request");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xd001u &&
               (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "one-shot pong disables");
}

static void interrupt_and_null_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x1000u, 0x70u, 0x2700u, 0u, DMA_TEST_READ_PAD, 3u);
    store_peripheral_word(cpu, 0x1111u);
    expect(state, request(cpu, 0x70u, 0u), "half first request");
    expect(state, !interrupt_flag(cpu, 0u), "half interrupt not early");
    expect(state, request(cpu, 0x70u, 0u), "half second request");
    expect(state, interrupt_flag(cpu, 0u), "half interrupt threshold");
    clear_interrupt(cpu, 0u);
    expect(state, request(cpu, 0x70u, 0u) && request(cpu, 0x70u, 0u),
           "half block completion");
    expect(state, !interrupt_flag(cpu, 0u), "half no full interrupt");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x1001u, 0x71u, 0x2700u, 0u, DMA_TEST_READ_PAD, 2u);
    store_peripheral_word(cpu, 0x2222u);
    expect(state, request(cpu, 0x71u, 0u), "odd half first request");
    expect(state, !interrupt_flag(cpu, 0u), "odd half not early");
    expect(state, request(cpu, 0x71u, 0u), "odd half second request");
    expect(state, interrupt_flag(cpu, 0u), "odd half rounds up");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, DMA_TEST_BIDIRECTIONAL_PAD, 0x7b7bu);
    configure_channel(cpu, 0u, 0x0801u, 0x72u, 0x2700u, 0u, DMA_TEST_BIDIRECTIONAL_PAD,
                      0u);
    expect(state, request(cpu, 0x72u, 0u), "null write request");
    expect(state, dspic33_read_word(cpu, 0x2700u) == 0x7b7bu,
           "null write retains input");
    expect(state, dspic33_read_word(cpu, DMA_TEST_BIDIRECTIONAL_PAD) == 0u,
           "null write clears peripheral");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2800u, 0x7b7bu);
    configure_channel(cpu, 0u, 0x0001u, 0x73u, 0x2700u, 0u, 0x2800u, 0u);
    expect(state, request(cpu, 0x73u, 0u), "invalid read PAD request");
    expect(state,
           dspic33_read_word(cpu, 0x2700u) == 0u &&
               dspic33_read_word(cpu, 0x2800u) == 0x7b7bu && interrupt_flag(cpu, 0u) &&
               (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) == 0u,
           "invalid read PAD supplies zero and completes without a handler");

    dspic33_reset(cpu, 0u);
    store_peripheral_word(cpu, 0x6a6au);
    configure_channel(cpu, 0u, 0x0801u, 0x74u, 0x2700u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, request(cpu, 0x74u, 0u), "read-only NULLW PAD request");
    expect(state,
           dspic33_read_word(cpu, 0x2700u) == 0x6a6au &&
               dspic33_read_word(cpu, DMA_TEST_READ_PAD) == 0x6a6au,
           "NULLW invokes no write handler for a read-only PAD");

    dspic33_reset(cpu, 0u);
    configure_channel(cpu, 0u, 0x0801u, 0x75u, 0x2700u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0x75u, 0u, 1u),
           "queue read-only NULLW with concurrent CPU write");
    store_peripheral_word(cpu, 0x5b5bu);
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_read_word(cpu, 0x0bf0u) == 0u &&
               cpu->trap_count == 0u,
           "read-only NULLW cannot raise a peripheral collision");
}

