tylertms/dspic33e-sim/conformance/dma.c
static void force_and_collision_cases(DmaConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_DMA_COUNT; channel++) {
        uint16_t base = channel_base(channel);
        uint16_t bit = (uint16_t)(1u << channel);
        uint8_t source = (uint8_t)(0x80u + channel);
        uint16_t memory = (uint16_t)(0x2900u + channel * 4u);
        uint16_t pad = DMA_TEST_WRITE_PAD;
        uint16_t first = (uint16_t)(0x1100u + channel);
        uint16_t second = (uint16_t)(0x2200u + channel);

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        dspic33_write_word(cpu, (uint16_t)(memory + 2u), second);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 3u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE software set matrix");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), source);
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE write zero cannot clear matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "FORCE start matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 0u &&
                   !interrupt_flag(cpu, channel) &&
                   (dspic33_read_word(cpu, base) & 0x8000u) != 0u,
               "FORCE remains active before completion matrix");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE remains set until completion matrix");
        expect(state, dspic33_device_advance(cpu, 1u), "FORCE completion matrix");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "FORCE hardware clear matrix");
        expect(state, cpu->io.dma_index[channel] == 1u,
               "FORCE completion advances count matrix");
        expect(state, dspic33_device_advance(cpu, 2u), "FORCE idle advance matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 1u,
               "FORCE exactly one transfer matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 1u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (cpu->io.dma_forced_pending & bit) != 0u,
               "FORCE pending before disable matrix");
        dspic33_write_word(cpu, base, 0x2000u);
        expect(state,
               (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u &&
                   (cpu->io.dma_forced_pending & bit) == 0u,
               "disable clears FORCE pending matrix");
        expect(state, dspic33_device_advance(cpu, 2u) && stored_word(cpu, pad) == 0u,
               "disabled FORCE does not transfer matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 1u);
        expect(state, dspic33_dma_request(cpu, source, 0u, 1u),
               "queue peripheral before FORCE matrix");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (dspic33_read_word(cpu, 0x0bf2u) & bit) != 0u,
               "peripheral before FORCE collision matrix");
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "peripheral before FORCE discard matrix");
        expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
               "peripheral before FORCE trap matrix");
        dspic33_write_word(cpu, 0x08c0u,
                           (uint16_t)(dspic33_read_word(cpu, 0x08c0u) & ~0x0020u));
        expect(state, dspic33_read_word(cpu, 0x0bf2u) == 0u,
               "peripheral before FORCE collision clear matrix");
        expect(state, dspic33_device_advance(cpu, 2u),
               "peripheral before FORCE advance matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 1u,
               "peripheral before FORCE one transfer matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        dspic33_write_word(cpu, (uint16_t)(memory + 2u), second);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 3u);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, dspic33_dma_request(cpu, source, 0u, 1u),
               "queue peripheral after FORCE matrix");
        expect(state, (dspic33_read_word(cpu, 0x0bf2u) & bit) != 0u,
               "FORCE before peripheral collision matrix");
        expect(state, dspic33_device_advance(cpu, 1u),
               "FORCE before peripheral start matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 0u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) != 0u,
               "FORCE executes before peripheral matrix");
        expect(state, dspic33_device_advance(cpu, 1u),
               "FORCE before peripheral deferred matrix");
        expect(state,
               stored_word(cpu, pad) == second && cpu->io.dma_index[channel] == 1u &&
                   (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "peripheral executes after FORCE matrix");
        expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
               "FORCE before peripheral trap matrix");
        expect(state,
               dspic33_device_advance(cpu, 1u) && cpu->io.dma_index[channel] == 2u,
               "peripheral collision completion matrix");

        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, first);
        dspic33_write_word(cpu, (uint16_t)(memory + 2u), second);
        configure_channel(cpu, channel, 0x2000u, source, memory, 0u, pad, 3u);
        expect(state,
               dspic33_dma_request(cpu, source, 0u, 0u) &&
                   dspic33_device_advance(cpu, 0u),
               "start active peripheral transfer matrix");
        expect(state, (cpu->io.dma_active & bit) != 0u,
               "peripheral transfer active matrix");
        expect(state,
               stored_word(cpu, pad) == first && cpu->io.dma_index[channel] == 0u,
               "active peripheral first transfer matrix");
        dspic33_write_word(cpu, (uint16_t)(base + 2u), (uint16_t)(DMA_FORCE | source));
        expect(state, (dspic33_read_word(cpu, (uint16_t)(base + 2u)) & DMA_FORCE) == 0u,
               "FORCE ignored while active matrix");
        expect(state, (dspic33_read_word(cpu, 0x0bf2u) & bit) != 0u,
               "active FORCE request collision matrix");
        expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
               "active FORCE collision trap matrix");
        expect(state, dspic33_device_advance(cpu, 1u),
               "active transfer completion matrix");
        expect(state, (cpu->io.dma_active & bit) == 0u,
               "active transfer clears matrix");
        expect(state, cpu->io.dma_index[channel] == 1u,
               "active transfer count completes matrix");
        expect(state,
               dspic33_device_advance(cpu, 1u) && stored_word(cpu, pad) == first &&
                   cpu->io.dma_index[channel] == 1u,
               "ignored active FORCE does not transfer matrix");
    }
}

static void routing_and_status_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2b00u, 0x1000u);
    dspic33_write_word(cpu, 0x2b20u, 0x2000u);
    configure_channel(cpu, 2u, 0x2000u, 0x90u, 0x2b20u, 0u, DMA_TEST_ALT_WRITE_PAD, 0u);
    configure_channel(cpu, 0u, 0x2000u, 0x90u, 0x2b00u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x90u, 0u), "shared request routing");
    expect(state,
           stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x1000u &&
               dspic33_read_word(cpu, DMA_TEST_ALT_WRITE_PAD) == 0x2000u,
           "shared request reaches channels");
    expect(state, dspic33_read_word(cpu, 0x0bf6u) == 2u,
           "lower channel priority executes first");
    expect(state, interrupt_flag(cpu, 0u) && interrupt_flag(cpu, 2u),
           "channel interrupt mapping");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x12346u, 0x55aau);
    configure_channel(cpu, 0u, 0x2001u, 0x91u, 0x12346u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x91u, 0u), "24-bit address request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x55aau,
           "24-bit memory transfer");
    expect(state,
           dspic33_read_word(cpu, 0x0bf8u) == 0x2346u &&
               dspic33_read_word(cpu, 0x0bfau) == 0x0001u,
           "DSADR records 24-bit address");
    expect(state, dspic33_read_word(cpu, 0x0bf6u) == 0u, "DMALCA records channel");

    dspic33_reset(cpu, 0u);
    cpu->data[0] = 0x9eu;
    cpu->data[1] = 0x9eu;
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0xffffu);
    configure_channel(cpu, 0u, 0x2001u, 0x92u, DSPIC33_DATA_SIZE, 0u,
                      DMA_TEST_WRITE_PAD, 0u);
    expect(state, request(cpu, 0x92u, 0u), "out-of-range request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0xffffu,
           "out-of-range DMA leaves peripheral unchanged");
    expect(state, cpu->last_trap == 6u && cpu->trap_count == 1u,
           "out-of-range DMA address trap");
    expect(state, (dspic33_read_word(cpu, 0x08c4u) & 0x0020u) != 0u,
           "out-of-range DMA sets DAE");
}

