tylertms/dspic33e-sim/conformance/dma.c
static void channel_matrix_cases(DmaConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_DMA_COUNT; channel++) {
        uint8_t source = (uint8_t)(0xb0u + channel);
        uint16_t memory = (uint16_t)(0x3000u + channel * 4u);
        uint16_t pad = DMA_TEST_WRITE_PAD;
        uint16_t value = (uint16_t)(0x4000u + channel);
        dspic33_reset(cpu, 0u);
        dspic33_write_word(cpu, memory, value);
        configure_channel(cpu, channel, 0x2001u, source, memory, 0u, pad, 0u);
        expect(state, request(cpu, source, 0u), "channel request matrix");
        expect(state, stored_word(cpu, pad) == value, "channel transfer matrix");
        expect(state, interrupt_flag(cpu, channel), "channel interrupt matrix");
        expect(state, dspic33_read_word(cpu, 0x0bf6u) == channel,
               "channel status matrix");
        expect(state, (dspic33_read_word(cpu, channel_base(channel)) & 0x8000u) == 0u,
               "channel one-shot matrix");
    }
}

static void peripheral_collision_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3200u, 0x1111u);
    dspic33_write_word(cpu, 0x3202u, 0x2222u);
    configure_channel(cpu, 0u, 0x2000u, 0xc0u, 0x3200u, 0u, DMA_TEST_WRITE_PAD, 1u);
    expect(state, dspic33_dma_request(cpu, 0xc0u, 0u, 1u),
           "queue peripheral write collision");
    dspic33_write_word(cpu, DMA_TEST_WRITE_PAD, 0x7777u);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance peripheral write collision");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x7777u,
           "CPU peripheral write prevails");
    expect(state, (dspic33_read_word(cpu, 0x0bf0u) & 1u) != 0u,
           "peripheral collision status");
    expect(state, cpu->last_trap == 5u && cpu->trap_count == 1u,
           "peripheral collision trap");
    expect(state, (dspic33_read_word(cpu, 0x08c0u) & 0x0020u) != 0u,
           "peripheral collision DMACERR");
    expect(state,
           dspic33_dma_request(cpu, 0xc0u, 0u, 0u) && dspic33_device_advance(cpu, 0u),
           "request blocked by collision");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x7777u,
           "collision blocks subsequent transfer");
    dspic33_write_word(cpu, 0x08c0u,
                       (uint16_t)(dspic33_read_word(cpu, 0x08c0u) & ~0x0020u));
    expect(state, dspic33_read_word(cpu, 0x0bf0u) == 0u,
           "clearing DMACERR clears write collision");
    expect(state, request(cpu, 0xc0u, 0u), "request resumes after collision clear");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x2222u,
           "transfer resumes after collision clear");
}

static void memory_collision_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3400u, 0x1111u);
    configure_channel(cpu, 0u, 0x2001u, 0xc1u, 0x3400u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0xc1u, 0u, 1u),
           "queue concurrent DMA memory read");
    dspic33_write_word(cpu, 0x3400u, 0x2222u);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance concurrent DMA memory read");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x1111u,
           "DMA reads pre-write memory value");
    expect(state, dspic33_read_word(cpu, 0x3400u) == 0x2222u,
           "CPU memory write remains visible");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x3400u, 0xaaaau);
    store_peripheral_word(cpu, 0x3333u);
    configure_channel(cpu, 0u, 0x0001u, 0xc2u, 0x3400u, 0u, DMA_TEST_READ_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0xc2u, 0u, 1u),
           "queue concurrent DMA memory write");
    dspic33_write_word(cpu, 0x3400u, 0xbbbbu);
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance concurrent DMA memory write");
    expect(state, dspic33_read_word(cpu, 0x3400u) == 0xbbbbu,
           "CPU write wins concurrent DMA memory write");
    expect(state, dspic33_read_word(cpu, 0x0bf0u) == 0u,
           "memory collision does not set peripheral status");
}

static void stale_request_cases(DmaConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, 0x2d00u, 0x1111u);
    configure_channel(cpu, 0u, 0x2000u, 0xa0u, 0x2d00u, 0u, DMA_TEST_WRITE_PAD, 0u);
    expect(state, dspic33_dma_request(cpu, 0xa0u, 0u, 5u), "queue stale request");
    dspic33_write_word(cpu, 0x0b00u, 0x2000u);
    dspic33_write_word(cpu, 0x2d00u, 0x2222u);
    dspic33_write_word(cpu, 0x0b00u, 0xa000u);
    expect(state, dspic33_device_advance(cpu, 5u), "advance stale request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0u,
           "stale request discarded after re-enable");
    expect(state, request(cpu, 0xa0u, 0u), "new generation request");
    expect(state, stored_word(cpu, DMA_TEST_WRITE_PAD) == 0x2222u,
           "new generation transfers");
}

int main(void) {
    DmaConformance state = {0u, 0u, 0u};
    Dspic33 cpu;
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize DMA processor");
    if (initialized) {
        pad_membership_cases(&state);
        register_cases(&state, &cpu);
        direction_and_width_cases(&state, &cpu);
        invalid_write_cases(&state, &cpu);
        addressing_cases(&state, &cpu);
        operating_mode_cases(&state, &cpu);
        interrupt_and_null_cases(&state, &cpu);
        force_and_collision_cases(&state, &cpu);
        routing_and_status_cases(&state, &cpu);
        channel_matrix_cases(&state, &cpu);
        peripheral_collision_cases(&state, &cpu);
        memory_collision_cases(&state, &cpu);
        stale_request_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[dma-summary] cases=%" PRIu32 " passed=%" PRIu32 " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    return state.failed == 0u ? 0 : 1;
}
